Revit 2026 API

# BoundingBoxXYZBoundEnabled Property

---

Indexed access for loops.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool this[
	int bound,
	int dim
] { get; set; }
```
```vb
Public Property BoundEnabled (
	bound As Integer,
	dim As Integer
) As Boolean
	Get
	Set
```
```cpp
public:
property bool BoundEnabled[int bound, int dim] {
	bool get (int bound, int dim);
	void set (int bound, int dim, bool value);
}
```
```fsharp
member BoundEnabled : bool with get, set
```

#### Parameters

bound Int32

dim Int32

#### Property Value

Boolean

For bound, use 0 for Min and 1 for Max. For dimension, use 0 for X, 1 for Y and 2 for Z. The entire box must be enabled to have enabled individual bounds.

#### Reference

BoundingBoxXYZ Class

Autodesk.Revit.DB Namespace